Autodesk.Revit.DB.Fabrication.FabricationPartJustification
Fabrication part eccentric justifications for alignment for flat edged parts.
Since:
2018
Since:
2018

Autodesk.Revit.DB.Fabrication.FabricationPartJustification.Top
Outside edge justification to the top

Autodesk.Revit.DB.Fabrication.FabricationPartJustification.Bottom
Outside edge justification to the bottom

Autodesk.Revit.DB.Fabrication.FabricationPartJustification.Middle
Default middle justification to the connector